rovOscAnim/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    xmin
    {
        type            patch;
        nFaces          8464;
        startFace       2779567;
    }
    xmax
    {
        type            patch;
        nFaces          8464;
        startFace       2788031;
    }
    ymin
    {
        type            patch;
        nFaces          8464;
        startFace       2796495;
    }
    ymax
    {
        type            patch;
        nFaces          8464;
        startFace       2804959;
    }
    zmin
    {
        type            patch;
        nFaces          8464;
        startFace       2813423;
    }
    zmax
    {
        type            patch;
        nFaces          8464;
        startFace       2821887;
    }
    BROV2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          32183;
        startFace       2830351;
    }
)

// ************************************************************************* //
